<?php
/*
 * При создание вида, который возвращает JSON , важно также установить соответствующий заголовок ответа. 
 * Хелпер JSON как раз и делает это. Так же, по умолчанию он отключает вывод макета (layout) если он включен, 
 * так как макеты обычно не используются при ответах в формате JSON.
 * Отправляет такой заголовок: Content-Type: application/json
 * Большинство AJAX библиотек ищет именно такой заголовок, что бы определить, как и что обрабатывать.
 */

$data = [1,2,3, ['sf'=>'sg', 122], 'dsfsd'=>'sdfs'];

echo $this->json($data);
echo '<br />';

/*
 * Zend\Json::encode() позволяет кодировать родные выражения JSON используя объект Zend\Json\Expr. 
 * Эта опция отключена по умолчанию. Для включения этой возможности передайте значение «TRUE» в ключ «enableJsonExprFinder» массива опций:
 */
echo $this->json( $data, ['enableJsonExprFinder' => true] );
